app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`category`, `created_at`, `updated_at`) VALUES ('Business', '2016-09-25 20:39:32', '2016-09-25 20:39:32')

    def set_category
      @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1