app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT `courses`.* FROM `courses`

  def new
    @category = Category.all
---
SELECT `categories`.* FROM `categories`

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`title`, `description`, `nivel`, `workload`, `active`, `completed_edition`, `created_at`, `updated_at`) VALUES ('Java Web', 'The best course for the  best languagem to web', 'Easy', 10, 1, 1, '2016-09-25 16:57:32', '2016-09-25 16:57:32')

  def destroy
    @course.destroy
---
DELETE FROM `courses` WHERE `courses`.`id` = 7

    def set_course
      @course = Course.find(params[:id])
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 7 LIMIT 1