app/controllers/registries_controller.rb

  def reg_user_course
    time = Time.new
    course = Course.find(params[:id])
    respond_to do |format|
      unless current_user.courses.find_by_id(course.id)
---
SELECT  `courses`.* FROM `courses` INNER JOIN `registries` ON `courses`.`id` = `registries`.`course_id` WHERE `registries`.`user_id` = 1 AND `courses`.`id` = 3 LIMIT 1