app/controllers/registries_controller.rb

  def reg_user_course
    time = Time.new #initializing date
    @course = Course.find(params[:id]) #find for course with params[:id]
    @user = User.find(current_user.id) #find for user with id of devise

    respond_to do |format|
      if Registry.where(user:@user, course:@course) == [] #valid if user already subscribe in course
          @registry = Registry.create(active:true,finished_course:false,limit_date:time+600_000,user:@user,course:@course)
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 4 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `registries` (`active`, `finished_course`, `limit_date`, `user_id`, `course_id`, `created_at`, `updated_at`) VALUES (1, 0, '30/09/2017', 1, 4, '2016-09-25 16:56:20', '2016-09-25 16:56:20')

  def index
    #@registries = Registry.all
    @registries = Registry.where(user_id: current_user.id) #Filter registration in course through users
---
SELECT `registries`.* FROM `registries` WHERE `registries`.`user_id` = 1

  def destroy
    @registry.destroy
---
DELETE FROM `registries` WHERE `registries`.`id` = 8

    def set_registry
      @registry = Registry.find(params[:id])
---
SELECT  `registries`.* FROM `registries` WHERE `registries`.`id` = 8 LIMIT 1