app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `cpf` = '35245646', `updated_at` = '2016-09-29 03:06:44' WHERE `users`.`id` = 1