app/views/categories/show.html.erb

SELECT `courses`.* FROM `courses` WHERE `courses`.`category_id` = 1
---
  <div class="row list_itens_center">
  <% @category.courses.each do |course|%>